<template>
  <div id="app">
    <transition name="vue-fade" mode="out-in">
      <section v-if="showHeader" class="header">
        <div class="container header-c">
          <div class="row header-r">
            <div class="col-12 col-md-8">
              <div class="menu-header">
                <div class="logo-c">
                  <img src="src/assets/img/logo.png">
                </div>
                <ul class="menu-ul">
                  <li>
                    <router-link to="/dashboard">
                      DashBoard
                    </router-link>
                  </li>
                  <li>
                    <router-link to="/catalog">
                      Каталоги
                    </router-link>
                  </li>
                  <li>
                    <router-link to="/provider">
                      Поставщики
                    </router-link>
                  </li>
                  <li>
                    <router-link to="/users">
                      Пользователи
                    </router-link>
                  </li>
                  <li>
                    <router-link to="/attachments">
                      Приложения
                    </router-link>
                  </li>
                </ul>
              </div>
            </div>
            <div class="col-12 col-md-4">
              <div class="h-user-c">
                <div class="h-user-info">
                  <div class="btn-c">
                    <button type="button" class="round-inf" data-toggle="tooltip" data-placement="bottom" data-original-title="Какая-то инфа">
                      <svg
                        xmlns="http://www.w3.org/2000/svg"
                        xmlns:xlink="http://www.w3.org/1999/xlink"
                        width="23px" height="23px">
                        <path fill-rule="evenodd"  fill="rgb(131, 147, 167)"
                              d="M11.500,23.000 C5.149,23.000 0.000,17.851 0.000,11.500 C0.000,5.149 5.149,-0.000 11.500,-0.000 C17.851,-0.000 23.000,5.149 23.000,11.500 C23.000,17.851 17.851,23.000 11.500,23.000 ZM11.500,5.000 C10.672,5.000 10.000,5.671 10.000,6.500 C10.000,7.328 10.672,8.000 11.500,8.000 C12.328,8.000 13.000,7.328 13.000,6.500 C13.000,5.671 12.328,5.000 11.500,5.000 ZM13.000,10.500 C13.000,9.671 12.328,9.000 11.500,9.000 C10.672,9.000 10.000,9.671 10.000,10.500 L10.000,16.500 C10.000,17.328 10.672,18.000 11.500,18.000 C12.328,18.000 13.000,17.328 13.000,16.500 L13.000,10.500 Z"/>
                      </svg>
                    </button>
                  </div>
                </div>
                <div class="h-user-profile">
                  <div class="user-discr flex-center">
                    <div class="ava-c">
                      <img src="src/assets/img/logo.png" alt="Имя пользователя">
                    </div>
                    <div class="user-info">
                      <div class="h-user-name">
                        User
                      </div>
                      <div class="h-user-role">
                        Administrator
                      </div>
                    </div>
                    <div class="user-control-menu">
                      <ul>
                        <li>
                          <router-link class="btn-icon-tr" to="/help">
                            <div class="svg-c">
                              <svg
                                xmlns="http://www.w3.org/2000/svg"
                                xmlns:xlink="http://www.w3.org/1999/xlink"
                                width="16px" height="17px">
                                <path fill-rule="evenodd"  fill="rgb(131, 147, 167)"
                                      d="M8.061,16.148 C3.766,16.148 0.285,12.666 0.285,8.371 C0.285,4.077 3.766,0.595 8.061,0.595 C12.356,0.595 15.837,4.077 15.837,8.371 C15.837,12.666 12.356,16.148 8.061,16.148 ZM9.075,4.990 C9.075,4.430 8.621,3.976 8.061,3.976 C7.501,3.976 7.046,4.430 7.046,4.990 L7.046,9.048 C7.046,9.608 7.501,10.062 8.061,10.062 C8.621,10.062 9.075,9.608 9.075,9.048 L9.075,4.990 ZM8.061,10.738 C7.501,10.738 7.046,11.192 7.046,11.752 C7.046,12.312 7.501,12.767 8.061,12.767 C8.621,12.767 9.075,12.312 9.075,11.752 C9.075,11.192 8.621,10.738 8.061,10.738 Z"/>
                              </svg>
                            </div>
                            <div class="txt-link">
                              Помощь
                            </div>
                          </router-link>
                        </li>
                        <li>
                          <router-link class="btn-icon-tr" to="/help">
                            <div class="svg-c">
                              <svg
                                xmlns="http://www.w3.org/2000/svg"
                                xmlns:xlink="http://www.w3.org/1999/xlink"
                                width="15px" height="16px">
                                <path fill-rule="evenodd"  fill="rgb(0, 129, 213)"
                                      d="M13.603,15.192 L2.262,15.192 C1.740,15.192 1.317,14.769 1.317,14.247 L1.317,12.672 L1.947,12.672 C2.643,12.672 3.207,12.108 3.207,11.412 C3.207,10.716 2.643,10.152 1.947,10.152 L1.317,10.152 L1.317,8.892 L1.947,8.892 C2.643,8.892 3.207,8.328 3.207,7.632 C3.207,6.936 2.643,6.372 1.947,6.372 L1.317,6.372 L1.317,5.112 L1.947,5.112 C2.643,5.112 3.207,4.548 3.207,3.852 C3.207,3.156 2.643,2.591 1.947,2.591 L1.317,2.591 L1.317,1.017 C1.317,0.494 1.740,0.071 2.262,0.071 L8.877,0.071 L8.877,7.002 L10.767,5.112 L12.658,7.002 L12.658,0.071 L13.603,0.071 C14.124,0.071 14.548,0.494 14.548,1.017 L14.548,14.247 C14.548,14.769 14.124,15.192 13.603,15.192 ZM2.577,3.852 C2.577,4.200 2.295,4.482 1.947,4.482 L0.687,4.482 C0.339,4.482 0.057,4.200 0.057,3.852 C0.057,3.504 0.339,3.222 0.687,3.222 L1.947,3.222 C2.295,3.222 2.577,3.504 2.577,3.852 ZM0.687,7.002 L1.947,7.002 C2.295,7.002 2.577,7.284 2.577,7.632 C2.577,7.980 2.295,8.262 1.947,8.262 L0.687,8.262 C0.339,8.262 0.057,7.980 0.057,7.632 C0.057,7.284 0.339,7.002 0.687,7.002 ZM0.687,10.782 L1.947,10.782 C2.295,10.782 2.577,11.064 2.577,11.412 C2.577,11.760 2.295,12.042 1.947,12.042 L0.687,12.042 C0.339,12.042 0.057,11.760 0.057,11.412 C0.057,11.064 0.339,10.782 0.687,10.782 Z"/>
                              </svg>
                            </div>
                            <div class="txt-link">
                              Отчеты
                            </div>
                          </router-link>
                        </li>
                        <li>
                          <router-link class="btn-icon-tr" to="/auth">
                            <div class="svg-c">
                              <svg
                                xmlns="http://www.w3.org/2000/svg"
                                xmlns:xlink="http://www.w3.org/1999/xlink"
                                width="16px" height="17px">
                                <path fill-rule="evenodd"  fill="rgb(131, 147, 167)"
                                      d="M15.132,8.811 C15.136,8.988 15.076,9.166 14.950,9.301 L11.879,12.610 C11.635,12.874 11.239,12.874 10.994,12.610 C10.750,12.347 10.750,11.920 10.994,11.657 L13.018,9.476 L7.715,9.476 C7.374,9.476 7.097,9.178 7.097,8.810 C7.097,8.442 7.374,8.144 7.715,8.144 L13.018,8.144 L10.994,5.963 C10.750,5.700 10.750,5.273 10.994,5.010 C11.239,4.746 11.635,4.746 11.879,5.010 L14.950,8.319 C15.076,8.454 15.136,8.632 15.132,8.809 L15.132,8.810 C15.132,8.810 15.132,8.810 15.132,8.811 ZM9.261,4.158 C8.748,4.158 8.334,3.711 8.334,3.159 L8.334,2.826 L4.316,2.826 L2.153,2.826 L2.153,14.811 L4.316,14.811 L8.334,14.811 L8.334,14.478 C8.334,13.926 8.748,13.479 9.261,13.479 C9.772,13.479 10.188,13.926 10.188,14.478 L10.188,14.811 L10.188,15.477 L10.188,15.810 C10.188,16.361 9.772,16.809 9.261,16.809 L1.226,16.809 C0.713,16.809 0.298,16.361 0.298,15.810 L0.298,1.828 C0.298,1.276 0.713,0.829 1.226,0.829 L9.261,0.829 C9.772,0.829 10.188,1.276 10.188,1.828 L10.188,2.160 L10.188,2.826 L10.188,3.159 C10.188,3.711 9.772,4.158 9.261,4.158 Z"/>
                              </svg>
                            </div>
                            <div class="txt-link">
                              Выход
                            </div>
                          </router-link>
                        </li>
                      </ul>
                    </div>
                  </div>
                  <div class="config-btn-c flex-center">
                    <router-link class="btn-icon-tr" to="/profileconfig" data-toggle="tooltip" data-placement="bottom" title="" data-original-title="Настройки профиля">
                      <svg
                        xmlns="http://www.w3.org/2000/svg"
                        xmlns:xlink="http://www.w3.org/1999/xlink"
                        width="24px" height="24px">
                        <path fill-rule="evenodd"  fill="rgb(131, 147, 167)"
                              d="M23.000,14.001 L20.749,14.001 C20.521,14.997 20.113,15.920 19.588,16.760 L21.192,18.365 C21.583,18.755 21.583,19.388 21.192,19.779 L19.778,21.193 C19.388,21.583 18.755,21.583 18.364,21.193 L16.769,19.597 C15.927,20.130 15.002,20.542 14.000,20.770 L14.000,23.001 C14.000,23.553 13.552,24.001 13.000,24.001 L11.000,24.001 C10.448,24.001 10.000,23.553 10.000,23.001 L10.000,20.770 C8.998,20.542 8.073,20.130 7.232,19.597 L5.636,21.193 C5.246,21.583 4.612,21.583 4.222,21.193 L2.808,19.779 C2.417,19.388 2.417,18.755 2.808,18.365 L4.412,16.760 C3.887,15.920 3.479,14.997 3.251,14.001 L1.000,14.001 C0.448,14.001 0.000,13.553 0.000,13.001 L0.000,11.001 C0.000,10.448 0.448,10.001 1.000,10.001 L3.251,10.001 C3.479,9.004 3.887,8.082 4.412,7.241 L2.808,5.637 C2.417,5.246 2.417,4.613 2.808,4.223 L4.222,2.808 C4.612,2.418 5.246,2.418 5.636,2.808 L7.232,4.404 C8.073,3.872 8.998,3.460 10.000,3.231 L10.000,1.001 C10.000,0.448 10.448,0.001 11.000,0.001 L13.000,0.001 C13.552,0.001 14.000,0.448 14.000,1.001 L14.000,3.231 C15.002,3.460 15.927,3.872 16.769,4.404 L18.364,2.808 C18.755,2.418 19.388,2.418 19.778,2.808 L21.192,4.223 C21.583,4.613 21.583,5.246 21.192,5.637 L19.588,7.241 C20.113,8.082 20.521,9.004 20.749,10.001 L23.000,10.001 C23.552,10.001 24.000,10.448 24.000,11.001 L24.000,13.001 C24.000,13.553 23.552,14.001 23.000,14.001 ZM12.000,6.001 C8.686,6.001 6.000,8.687 6.000,12.000 C6.000,15.315 8.686,18.001 12.000,18.001 C15.314,18.001 18.000,15.315 18.000,12.000 C18.000,8.687 15.314,6.001 12.000,6.001 ZM12.000,15.001 C10.343,15.001 9.000,13.657 9.000,12.000 C9.000,10.344 10.343,9.000 12.000,9.000 C13.657,9.000 15.000,10.344 15.000,12.000 C15.000,13.657 13.657,15.001 12.000,15.001 Z"/>
                      </svg>
                    </router-link>
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </section>
    </transition>

    <div class="container">
      <div class="row">
        <!--<div class="col-12">-->
          <!--<appUiKit></appUiKit>-->
        <!--</div>-->
        <div class="col-12">
          <!-- отображаем тут компонент, для которого совпадает маршрут -->
          <transition name="vue-fade" mode="out-in">
            <router-view>
            </router-view>
          </transition>
        </div>
      </div>
    </div>
  </div>
</template>

<script>

  import {mapGetters} from 'vuex'; // Теперь можно писать {{getterNameFromStore}}, Предварительно передать mapGetters в computed

  export default {
    name: 'app',
    data () {
      return {
        msg: 'TopKek',
      }
    },
    methods:{

    },
    computed: {
      ...mapGetters([
        'showHeader',
        'logedIn'
      ])
    },
    mounted(){
      //init bootstrap tooltips
      $(function () {
        // $('[data-toggle="tooltip"]').tooltip();
      });
    }
  }

</script>

<style lang="sass">
  @import 'assets/libs/jQueryFormStyler-master/dist/jquery.formstyler.css'
  @import 'assets/libs/jQueryFormStyler-master/dist/jquery.formstyler.theme.css'

  @import 'assets/sass/main.sass'
  @import url('https://fonts.googleapis.com/css?family=Roboto:300,400,500,700,900&subset=cyrillic,cyrillic-ext');
</style>
